In [10]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [11]:
#index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [13]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [14]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [15]:
df

             A         B
G1 1  0.505307 -0.561976
   2 -0.131935  1.903372
   3 -0.080872  0.658421
G2 1  1.134426 -2.140524
   2 -0.067582  0.064724
   3 -1.326096 -0.419932

In [18]:
df.loc['G1']

          A         B
1  0.505307 -0.561976
2 -0.131935  1.903372
3 -0.080872  0.658421

In [19]:
df.loc['G1'].loc[1]

A    0.505307
B   -0.561976
Name: 1, dtype: float64

In [21]:
df.index.names

FrozenList([None, None])

In [22]:
df.index.names = ['Groups','Num']

In [23]:
df

                   A         B
Groups Num
G1     1    0.505307 -0.561976
       2   -0.131935  1.903372
       3   -0.080872  0.658421
G2     1    1.134426 -2.140524
       2   -0.067582  0.064724
       3   -1.326096 -0.419932

In [24]:
df.loc['G2']

            A         B
Num
1    1.134426 -2.140524
2   -0.067582  0.064724
3   -1.326096 -0.419932

In [25]:
df.loc['G2'].loc[2]

A   -0.067582
B    0.064724
Name: 2, dtype: float64

In [26]:
df.loc['G2'].loc[2].B

np.float64(0.06472440896366055)

In [27]:
df

                   A         B
Groups Num
G1     1    0.505307 -0.561976
       2   -0.131935  1.903372
       3   -0.080872  0.658421
G2     1    1.134426 -2.140524
       2   -0.067582  0.064724
       3   -1.326096 -0.419932

In [28]:
df.loc['G1']

            A         B
Num
1    0.505307 -0.561976
2   -0.131935  1.903372
3   -0.080872  0.658421

In [30]:
df.xs('G1')

            A         B
Num
1    0.505307 -0.561976
2   -0.131935  1.903372
3   -0.080872  0.658421

In [31]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.505307 -0.561976
G2      1.134426 -2.140524

In [32]:
df.xs(3,level='Num')

               A         B
Groups
G1     -0.080872  0.658421
G2     -1.326096 -0.419932